Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: we call these bones ribs .
af: hierdie ribbes is agter met die werwelkolom verbind en die meeste is voor met die borsbeen vebind .

source: these ribs are joined to the backbone and often to the front to form the rib cage .
af: gesamentlik vorm dit die ribbekas .

source: many mammals have a similar shape rib cage .
af: baie soogdiere het 'n soortgelyke ribbekas .

source: compare the rib cages of these animals to your own .
af: vergelyk die ribbekas van hierdie diere .

source: vertebrates use their fore and hind limbs for movement .
af: vertebrate gebruik hulle voor en agterledemate vir beweging .

source: many animals' limbs are attached to their bodies at the shoulder or hip joints .
af: baie diere se ledemate is by die skouer ofheupgewrigte aan die liggaam vergeheg .

source: however not all animals have hip or shoulder girdles think of fish and snakes .
af: alle vertebrate het egter nie heup of skouergordels nie dink aan visse en slange .

source: videos about the skeletal system http www.youtube.com watch?v aqluivttlxo
af: skeletstelsel videos goo.gl tmrry

source: the bones in different vertebrate limbs look very similar .
af: die bene in verskillende vertebrate se ledemate is soortgelyk .

source: look at the picture which shows the limbs of different animals .
af: kyk na die illustrasie wat die ledemate van verskillende diere aantoon .

source: now that you know a little more about a bones let's see how animals use their bones joints and muscles to help them move .
af: noudat jy 'n bietjie meer van bene weet kom ons kyk hoe diere hierdie bene gewrigte en spiere gebruik om hulle te help beweeg .

source: do you remember what a skeleton's function is ?
af: onthou jy nog wat 'n skelet se funksie is ?

source: list as many of the functions of the skeleton as you can think of below .
af: lys soveel as moontlik van die funksies van die skelet hieronder .

source: vertebrate animals can move because of two really important things
af: vertebrate kan beweeg om twee baie belangrike redes

source: if you want to know how an animal moves you need to know how their joints and their muscles work .
af: indien jy wil weet hoe 'n dier beweeg moet jy weet hoe die gewrigte en spiere werk .

source: there are many ways to introduce this topic and depending on the class' discipline and behaviour one might be inclined to choose one rather than the other .
af: daar is baie maniere om hierdie onderwerp bekend te stel en afhangende van die klasdissipline en gedrag mag f die een f die ander gekies word .

source: joints are the places where bones come together .
af: gewrigte is die plekke waar bene bymekaarkom .

source: they come together in a special way to allow the animal or human to move like at your elbow or wrist .
af: hulle kom bymekaar op 'n spesiale manier wat die dier of mens toelaat om te beweeg soos by die elmboog of pols .

source: there are different kinds of joints .
af: daar is verskillende tipes gewrigte .

source: video types of joints
af: video tipes gewrigte

source: list four other joints in your skeleton .
af: noem vier ander gewrigte in die skelet .

source: elbow joint shoulder joint hip joint joints between fingers joints between toes ankle joint etc
af: elmbooggewrig skouergewrig heupgewrig gewrigte tussen vingers gewrigte tussen tone enkelgewrig ens .

source: look at the example of the moving arm .
af: kom ons kyk na die voorbeeld van die arm wat beweeg .

source: look at the picture .
af: kyk na die illustrasie .

source: there are two muscles which enable your arm to move your tricep and bicep .
af: daar is twee spiere wat jou arm laat te beweeg die triseps driekopspier en die biseps tweekopspier .

source: they work as a pair .
af: hulle werk as 'n paar .

source: when the one muscle contracts the opposite muscle relaxes .
af: wanneer die een spier saamtrek verslap die ander spier .

source: to bend your arm the bicep muscle contracts and pulls on the radius bone .
af: om die arm te buig trek die biseps saam en trek aan die radiusbeen .

source: the tricep muscle relaxes allowing your arm to bend at the elbow joint .
af: die triseps verslap en die arm buig dan by die elmbooggewrig .

source: to straighten your arm the tricep muscle contracts and pulls on the ulna bone while your bicep muscle relaxes and your arm straightens .
af: die arm word reguit gemaak wanneer die triseps saamtrek en aan die ulnabeen trek terwyl die biseps verslap .

source: now that you know that bones and joints are controlled by muscles let's look at the ways that muscles and bones make you and other vertebrates move !
af: noudat jy weet dat bene en gewrigte deur spiere beheer word om jou te laat beweeg kom ons kyk na 'n paar van die maniere waarop spiere en bene jou en ander vertebrate laat beweeg !

source: this is a time saving clause as this game can drag on and on if they are given multiple opportunities to mime .
af: om tyd te bespaar aangesien hierdie speletjie baie lank kan aangaan stel die volgende rels in almal behoort die eerste keer behoorlik te kyk .

source: suggestion depending on the class atmosphere and discipline teachers can choose to let the mime choose who should answer but it might be easier if teachers called the names of those who should venture a guess .
af: voorstel afhangende van die atmosfeer en dissipline in die klas kan onderwysers besluit om die nabootser toe te laat om te kies wiemag antwoord maar dit mag makliker wees indien onderwysers die name uitroep van die leerders wat 'n raaiskoot mag waag .

source: what type of skeleton do you have ?
af: watter tipe skelet het jy ?

source: endoskeleton
af: endoskelet

source: what do all vertebrate animals have that makes them vertebrates ?
af: wat het alle vertebrate wat hulle vertebrate maak ?

source: vertebrates have a backbone and skeleton inside their bodies .
af: vertebrate het 'n werwelkolom en 'n endoskelet van been in hul liggame .

source: what is a major difference between the skeletons of a mouse a crab and an earthworm ?
af: wat is die belangrikste verskil tussen die skelette van 'n muis 'n krap en 'n erdwurm ?

source: name the three things that all vertebrates need to be able to move .
af: noem drie dinge wat alle werweldiere nodig het om te kan beweeg .

source: bones joints and muscles; if they say tendons and ligaments that is technically correct too so give them a point for each one this should earn them 2 bonus points
af: bene gewrigte en spiere .

source: what is the difference between the way a human move the way a dolphin moves and the way a dog moves ?
af: wat is die verskil tussen die manier waarop 'n mens beweeg die manier waarop 'n dolfyn beweeg en die manier waarop 'n hond beweeg ?

source: describe the movement of each animal the limbs that are used and the position of the body .
af: beskryf die beweging van elke dier die ledemate wat gebruik word en die posisie van die liggaam tydens beweging .

source: a human walks upright on the hind limbs whereas a dog walks on all four limbs .
af: 'n mens loop regop op sy onderste ledemate terwyl 'n hond op al vier ledemate loop .

source: a dolphin uses its front limbs and its tail to move through the water .
af: 'n dolfyn gebruik sy voorste ledemate en sy stert om deur die water te beweeg .

source: a human and a dog move on the ground whereas a dolphin moves in the water .
af: 'n mens en 'n hond beweeg op land terwyl 'n dolfyn in die water beweeg .

source: humans and dogs have four limbs but a dolphin only has two limbs and a tail for movement .
af: mense en honde het vier ledemate maar 'n dolfyn het net twee ledemate en 'n stert vir beweging .

source: this is a technology unit and will follow the principles of technology teaching and specifically the design process .
af: dit is 'n tegnologie eenheid en sal die beginsels van tegnologie onderrig en spesifiek die ontwerpproses volg .

source: as such the different activities in this unit will be preparing learning to build their own shell or frame structure at the end of the unit these are called enabling activities .
af: as sulks sal die verskillende aktiwiteite in hierdie eenheid leerders voorberei om hul eie dop of raamstruktuur aan die einde van die eenheid te bou .

source: they are designed to enable learners to tackle the problem at the end of the unit with the necessary knowledge understanding and skill to complete it confidently .
af: hulle word bemagtigende aktiwiteite genoem .

source: learners will have to make a model of a vertebrate skeleton using struts made from rolled paper or drinking straws as a project .
af: leerders sal 'n model van 'n werweldierskelet as 'n projek moet maak deur versterkings van gerolde papier of plastiekstrooitjies te gebruik .

source: enabling activities in this unit will therefore be
af: bemagtigende aktiwiteite in hierdie eenheid sal gevolglik wees

source: once learners have gained a good understanding of these four points they are required to make a model of a vertebrate skeleton using these skills .
af: wanneer leerders 'n goeie begrip van hierdie vier punte het word daar van hulle vereis om met behulp van hierdie vaardighede 'n model van 'n werweldierskelet te maak .

source: in this chapter we will investigate two kinds of structures frame and shell structures .
af: in hierdie hoofstuk ondersoek ons twee soorte strukture dop en raamstrukture .

source: a structure is something that is arranged or put together in a specific way and is made up of different parts .
af: 'n struktuur is iets wat op 'n baie spesifieke manier gerangskik of saamgestel is en uit verskillende dele opgebou is .

source: a jungle gym is an example of a structure .
af: 'n klimraam is 'n voorbeeld van 'n struktuur .

source: it has many different parts like beams ropes and bars that are put together in a special way .
af: dit het baie verskillende onderdele soos houtpale toue en stawe wat almal op 'n spesiale manier aanmekaar gesit is .

source: a jungle gym is a type of structure. http www.flickr.com photos laffy4k 93484023
af: 'n klimraam is 'n tipe struktuur. http www.flickr.com photos laffy4k 93484023

source: most structures are designed to remain stable and rigid which means they should not break and crumble or topple and fall over if something heavy is placed on top of or against them .
af: die meeste strukture is ontwerp om stabiel en stewig te bly wat beteken dat hulle nie sal breek en verkrummel of omval wanneer iets swaar op hulle of teen hulle geplaas word nie .

source: structures have different jobs or functions .
af: strukture het verskillende take of funksies .

source: they
af: dit sluit in

source: we get three kinds of structures
af: daar is drie soorte strukture

source: in all structures the shape of the structure is very important .
af: met alle strukture is die vorm van die struktuur baie belangrik .

source: a structure will be able to resist or hold a certain weight depending on its shape .
af: 'n struktuur se vorm bepaal in watter mate dit 'n sekere gewig sal kan dra of teenstaan .

source: in gr. 4 in matter and materials we looked at strong frame structures and also how to make structures stronger using struts and braces .
af: in gr. 4 materie en materiale het ons geleer van sterk raamstrukture en ook hoe om strukture sterker te maak deur gebruik te maak van stutte en hoeksteune .

source: in this chapter in life and living we are going to focus on two kinds of structures frame structures and shell structures .
af: in hierdie hoofstuk gaan ons fokus op twee soorte strukture raamstrukture en dopstrukture .

source: this is because they relate to the skeletons of animals .
af: dit is omdat hulle met die skelette van diere verbind kan word .

source: turn to a friend and think about the words shell structure and frame structure and think what these could mean .
af: draai na 'n klasmaat en bespreek die woorde dopstruktuur en raamstruktuur en probeer bepaal wat hierdie begrippe kan beteken .

source: then think of examples of frame structures and of shell structures that you can see in buildings or perhaps on your walk or ride to school .
af: dink dan aan voorbeelde van raamstrukture en van dopstrukture wat jy in geboue kan sien miskien terwyl jy skool toe loop of ry .

source: report back and discuss these with your class .
af: rapporteer terug en bespreek dit met die klas .

source: teachers can use this question to assess pre existing knowledge of shell and frame structures as similar work should have been covered in the previous year .
af: onderwysers kan hierdie vraag gebruik om voorkennis van dop en raamstrukture te assesseer aangesien soortgelyke werk in graad 4 behandel moes gewees het .

source: frame structures burglar bars palisade fences cell phone towers eskom towers sieve jungle gym etc .
af: raamstrukture diefwering heinings selfoontorings eskom torings siwwe hout en metaalklimrame ens .

source: shell structures tortoise shell hut trailer canopy on a bakkie eggshell snail shell lids pipes etc .
af: dopstrukture skilpaddop hutte sleepwa bakkie kap eierdop slakdop deksels pype ens .

source: frame structures are easy to identify because they have a frame or a skeleton .
af: raamstrukture is maklik om te identifiseer omdat hulle 'n raam of skelet het .

source: these structures are built or put together by attaching pieces of material together to make a frame .
af: hierdie strukture word gebou of saamgestel deur stukke materiaal aan mekaar te heg om 'n raam te maak .

source: look at these photos of frame structures .
af: kyk na al die foto's van raamstrukture .

source: these photos are all examples of frame structures .
af: hierdie foto's is almal voorbeelde van raamstrukture .

source: in some the frame is clearly visible these are called open frame structures .
af: in sommige foto's is die raam duidelik sigbaar dit word oop raamstrukture genoem .

source: in others the frame is covered by a skin .
af: by sommige is die raam bedek met 'n oortreksel .

source: turn to a friend and discuss what you think all these structures have in common what is the same ?
af: bespreek met een van jou maats wat julle dink al hierdie strukture in gemeen het wat is dieselfde by almal ?

source: report back to your class .
af: rapporteer terug aan die klas .

source: there are struts and triangle shapes .
af: daar is stutte en driehoekige vorms .

source: the frame is sometimes bare and is the whole structure such as the pyon or jungle gym or the frame structure is covered by a skin such as the leaf .
af: die raam is soms onbedek en vorm die hele struktuur soos met 'n spantoring of klimraam of die raamstruktuur kan bedek wees met 'n oortreksel vel soos in die geval van 'n blaar .

source: one of the most important frame structures for all vertebrate animals is their skeleton .
af: een van die belangrikste raamstrukture van alle werweldiere is die skelet .

source: the material used to make this frame is bone that is attached to the muscles that move the skeleton .
af: die materiaal waarvan hierdie raamwerk gemaak is is been wat aan spiere geheg is wat die skelet laat beweeg .

source: the skeleton supports the muscles and protects the organs .
af: die skelet ondersteun die spiere en beskerm die organe .

source: here is a picture of a human rib cage .
af: hier is 'n illustrasie van 'n menslike ribbekas .

source: can you see how it makes a frame structure ?
af: kan jy sien dat dit 'n raamstruktuur vorm ?

source: which organs does the rib cage protect ?
af: watter organe word deur die ribbekas beskerm ?

source: the heart lungs and liver
af: die hart longe en lewer

source: in general we can say that all vertebrates have a frame structure as a skeleton .
af: ons kan in die algemeen s dat alle werweldiere 'n raamstruktuur as 'n skelet het .

source: this is because vertebrates have an endoskeleton which supports makes a frame to support the body .
af: dit is omdat werweldiere 'n endoskelet het wat 'n raamwerk vorm om die liggaam te ondersteun .

source: shell structures generally hold or protect things inside the structure .
af: dopstrukture beskerm of bevat gewoonlik voorwerpe binne in die struktuur .

source: humans make shell structures to protect and hold things like a dish a tin a car or house .
af: mense bou dopstrukture om goed mee te beskerm of binne te hou byvoorbeeld 'n skottel 'n blik 'n motor of 'n huis .

source: in nature eggshells and the exoskeletons of invertebrates like crab and crayfish shells are examples of shell structures .
af: eierdoppe en die eksoskelette van ongewerwelde diere soos krap en kreefdoppe is voorbeelde van dopstrukture in die natuur .

source: shell structures are made to resist a very heavy load .
af: dopstrukture is gemaak om 'n baie swaar vrag of las te weerstaan .

source: it is almost impossible to crush an eggshell if you hold it vertically between your thumb and index finger !
af: dit is amper onmoontlik om 'n eierdop stukkend te druk as jy dit vertikaal tussen jou duim en wysvinger hou !

source: structures that protect something or hold a weight without breaking or falling need to be really strong .
af: strukture wat iets beskerm of 'n swaar vrag moet dra sonder om te breek of te val moet baie sterk wees .

source: let's investigate the different ways we can use to strengthen a structure .
af: kom ons ondersoek die verskillende maniere waarop ons strukture kan versterk .

source: do you remember in gr. 4 matter and materials when we looked at whether a triangle or a square was stronger ?
af: onthou jy dat ons in materie en materiale in graad 4 gekyk het watter een van 'n driehoek of 'n vierkant die sterkste is ?

source: look at the picture to remind yourself .
af: kyk na die illustrasie om jou daaraan te herinner .

source: when you press on the shapes as in the picture which shape is the most stable and rigid ?
af: indien jy teen die vorms in die illustrasie kon druk watter een is die meeste stabiel en stewig ?

source: explain how you could make the other shape stronger and more stable .
af: verduidelik hoe jy die ander vorm sterker en meer stabiel kan maak .

source: the triangle is the strongest .
af: die driehoek is die sterkste .

source: the square can easily be squashed .
af: die vierkant kan maklik platgedruk word .

source: you can make the square stronger by putting a diagonal strut in from one corner to the other .
af: jy kan die vierkant sterker maak deur 'n diagonale stutvan die een hoek na die ander in te sit .

source: corners in structures are very important because it is often the weakest point of a structure .
af: hoeke van strukture is baie belangrik omdat dit dikwels die swakste plek in die struktuur is .

source: to strengthen corners you can
af: om hoeke te versterk

source: this is the first time learners are doing a technology project in grade 5 .
af: dit is die eerste tegnologieprojek wat die leerders in graad 5 doen .

source: they will have done some projects in gr. 4 but it will be useful to emphasise the design process again as you are going through the project .
af: hulle sou reeds 'n paar projekte in graad 4 gedoen het maar dit is raadsaam om die onwerpsproses weer te beklemtoon soos u deur die projek gaan .

source: the first step is to identify a need to do a design .
af: die eerste stap is om die behoefte om 'n ontwerp tedoen te identifiseer .

source: in this case a scenario has been set up that the local museum is looking for models of skeletons to put on display and farrah has a suggestion for the gr. 5 class to build their own models as you have just been learning about skeletons as structures .
af: in hierdie geval is die scenario dat die plaaslike museum op soek is na skelette om uit te stal en dat farrah voorstel dat die graad 5 klas hul eie modelle bou aangesien hulle pas van skelette geleer het .

source: use this to generate the need for doing the design and making the model .
af: gebruik hierdie agtergrond om die behoefte om die model te ontwerp en te bou aan te moedig .

source: at the end you can make a display on one side of the classroom as if it is the museum and place the models on display with name tags for each skeleton .
af: aan die einde kan u 'n uitstalling aan die een kant van die klas opstel waar die modelle geplaas kan word; elkeen met 'n naamplaatjie .

source: i stands for investigating the problem which some people have investigating existing products and investigating concepts and skills that you will need to solve the problem .
af: o staan vir ondersoek die behoefte wat sommige mense het .

source: in this case you would have already done a lot of investigating prior to the activity when first looking at animal skeletons and then at structures and ways to strengthen structures .
af: ondersoek bestaande produkte en oplossings sowel as konsepte en vaardighede wat jy nodig sal h om die probleem op te los .

source: learners must use this knowledge and experience when doing their designs .
af: in hierdie geval sou heelwat van die ondersoek reeds gedoen gewees het selfs voor die aktiwiteit toe daar gekyk is na diereskelette en maniere om strukture te versterk .

source: d stands for designing .
af: o staan vir ontwerp wat beteken om dt wat uit die ondersoek geleer is te gebruik om aan goeie metodes te dink om die probleem op te los .

source: that means using what you learned from investigations to think of good ways to solve the problem .
af: onthou dat leerders soos hulle deur die projek werk met nuwe ontwerpe vir hul skelette vorendag mag kom .

source: remember that learners may come up with new designs for their skeleton as they are going through the project .
af: verseker hulle dat wysigings toelaatbaar is en dat hulle nie die oorsponklike idee moet skrap nie maar dat hulle moet aandui hoe hul idee gevorder en verander het asook waarom hulle die ontwerp moes verander .

source: m stands for making .
af: m staan vir maak .

source: when you make your model you use the materials and tools specified to make the model according to the design .
af: wanneer die model gemaak word word die gespesifiseerde materiale en gereedskap volgens die ontwerp gebruik .

source: notice that most children design with their hands not only with pencil and paper .
af: let op dat die meeste kinders met hulle hande ontwerp en nie slegs met pen en papier nie .

source: as they work with materials they get more ideas and their design improves .
af: soos hulle met die materiale werk kry hulle meer idees en hul ontwerp raak beter .

source: so we should think of designing and making as more or less the same stage of a project .
af: ons behoort aan ontwerp en maak te dink as deel van dieselfde fase van die projek .

source: e stands for evaluating .
af: e staan vir evaluering .

source: after you have made the model of a skeleton you need to evaluate it to see if it followed the specifications for example can it stand up by itself ?
af: nadat die model van die skelet gemaak is moet dit gevalueer word om te bepaal of dit wel die spesifikasies nagekom het byvoorbeeld kan dit alleen regop staan ?

source: is the model 3d and realistic ?
af: is die model driedimensioneel en realisties ?

source: is it a stable structure ?
af: is dit 'n stewige struktuur ?

source: are there any improvements to be made ?
af: is daar enige verbeterings wat gemaak kan word ?

source: c stands for communicating .
af: k staan vir kommunikasie leerders moet aan ander mense kan verduidelik hoe hulle op die oplossing van die probleem besluit het .

source: learners must show other people how they decided on their solution to the problem .
af: die leerders behoort dwarsdeur die projek te teken en inligting neer te skryf .

source: the learners should be drawing and writing all through the project .
af: moenie die opskryf tot aan die einde los nie aangesien leerders dit in daardie stadium vervelig sal vind .
